arduino/Arduino/hardware/cc2600emt/cores/cc2600emt/inc/hw_ddi.h
// The following are defines for the bit fields in the DDI_O_SET2023 register.
//
//*****************************************************************************
#define DDI_SET2023_S3_M        0xFF000000  // A high bit value will set the
                                            // corresponding bit in DDI
                                            // register 23. Read returns 0.
#define DDI_SET2023_S3_S        24
#define DDI_SET2023_S2_M        0x00FF0000  // A high bit value will set the
                                            // corresponding bit in DDI
                                            // register 22. Read returns 0.
#define DDI_SET2023_S2_S        16
#define DDI_SET2023_S1_M        0x0000FF00  // A high bit value will set the
                                            // corresponding bit in DDI
                                            // register 21. Read returns 0.
#define DDI_SET2023_S1_S        8
#define DDI_SET2023_S0_M        0x000000FF  // A high bit value will set the
                                            // corresponding bit in DDI
                                            // register 20. Read returns 0.
#define DDI_SET2023_S0_S        0
//*****************************************************************************
//
// The following are defines for the bit fields in the DDI_O_SET2427 register.
//
//*****************************************************************************
#define DDI_SET2427_S3_M        0xFF000000  // A high bit value will set the
                                            // corresponding bit in DDI
                                            // register 27. Read returns 0.
#define DDI_SET2427_S3_S        24
#define DDI_SET2427_S2_M        0x00FF0000  // A high bit value will set the
                                            // corresponding bit in DDI
                                            // register 26. Read returns 0.
#define DDI_SET2427_S2_S        16
#define DDI_SET2427_S1_M        0x0000FF00  // A high bit value will set the
                                            // corresponding bit in DDI
                                            // register 25. Read returns 0.
#define DDI_SET2427_S1_S        8
#define DDI_SET2427_S0_M        0x000000FF  // A high bit value will set the
                                            // corresponding bit in DDI
                                            // register 24. Read returns 0.
#define DDI_SET2427_S0_S        0
//*****************************************************************************
//
// The following are defines for the bit fields in the DDI_O_SET2831 register.
//
//*****************************************************************************
#define DDI_SET2831_S3_M        0xFF000000  // A high bit value will set the
                                            // corresponding bit in DDI
                                            // register 31. Read returns 0.
#define DDI_SET2831_S3_S        24
#define DDI_SET2831_S2_M        0x00FF0000  // A high bit value will set the
                                            // corresponding bit in DDI
                                            // register 30. Read returns 0.
#define DDI_SET2831_S2_S        16
#define DDI_SET2831_S1_M        0x0000FF00  // A high bit value will set the
                                            // corresponding bit in DDI
                                            // register 29. Read returns 0.
#define DDI_SET2831_S1_S        8
#define DDI_SET2831_S0_M        0x000000FF  // A high bit value will set the
                                            // corresponding bit in DDI
                                            // register 28. Read returns 0.
#define DDI_SET2831_S0_S        0
//*****************************************************************************
//
// The following are defines for the bit fields in the DDI_O_SET3235 register.
//
//*****************************************************************************
#define DDI_SET3235_S3_M        0xFF000000  // A high bit value will set the
                                            // corresponding bit in DDI
                                            // register 35. Read returns 0.
#define DDI_SET3235_S3_S        24
#define DDI_SET3235_S2_M        0x00FF0000  // A high bit value will set the
                                            // corresponding bit in DDI
                                            // register 34. Read returns 0.
#define DDI_SET3235_S2_S        16
#define DDI_SET3235_S1_M        0x0000FF00  // A high bit value will set the
                                            // corresponding bit in DDI
                                            // register 33. Read returns 0.
#define DDI_SET3235_S1_S        8
#define DDI_SET3235_S0_M        0x000000FF  // A high bit value will set the
                                            // corresponding bit in DDI
                                            // register 32. Read returns 0.
#define DDI_SET3235_S0_S        0
//*****************************************************************************
//
// The following are defines for the bit fields in the DDI_O_SET3639 register.
//
//*****************************************************************************
#define DDI_SET3639_S3_M        0xFF000000  // A high bit value will set the
                                            // corresponding bit in DDI
                                            // register 39. Read returns 0.
#define DDI_SET3639_S3_S        24
#define DDI_SET3639_S2_M        0x00FF0000  // A high bit value will set the
                                            // corresponding bit in DDI
                                            // register 38. Read returns 0.
#define DDI_SET3639_S2_S        16
#define DDI_SET3639_S1_M        0x0000FF00  // A high bit value will set the
                                            // corresponding bit in DDI
                                            // register 37. Read returns 0.
#define DDI_SET3639_S1_S        8
#define DDI_SET3639_S0_M        0x000000FF  // A high bit value will set the
                                            // corresponding bit in DDI
                                            // register 36. Read returns 0.
#define DDI_SET3639_S0_S        0
//*****************************************************************************
//
// The following are defines for the bit fields in the DDI_O_SET4043 register.
//
//*****************************************************************************
#define DDI_SET4043_S3_M        0xFF000000  // A high bit value will set the
                                            // corresponding bit in DDI
                                            // register 43. Read returns 0.
#define DDI_SET4043_S3_S        24
#define DDI_SET4043_S2_M        0x00FF0000  // A high bit value will set the
                                            // corresponding bit in DDI
                                            // register 42. Read returns 0.
#define DDI_SET4043_S2_S        16
#define DDI_SET4043_S1_M        0x0000FF00  // A high bit value will set the
                                            // corresponding bit in DDI
                                            // register 41. Read returns 0.
#define DDI_SET4043_S1_S        8
#define DDI_SET4043_S0_M        0x000000FF  // A high bit value will set the
                                            // corresponding bit in DDI
                                            // register 40. Read returns 0.
#define DDI_SET4043_S0_S        0
//*****************************************************************************
//
// The following are defines for the bit fields in the DDI_O_SET4447 register.
//
//*****************************************************************************
#define DDI_SET4447_S3_M        0xFF000000  // A high bit value will set the
                                            // corresponding bit in DDI
                                            // register 47. Read returns 0.
#define DDI_SET4447_S3_S        24
#define DDI_SET4447_S2_M        0x00FF0000  // A high bit value will set the
                                            // corresponding bit in DDI
                                            // register 46. Read returns 0.
#define DDI_SET4447_S2_S        16
#define DDI_SET4447_S1_M        0x0000FF00  // A high bit value will set the
                                            // corresponding bit in DDI
                                            // register 45. Read returns 0.
#define DDI_SET4447_S1_S        8
#define DDI_SET4447_S0_M        0x000000FF  // A high bit value will set the
                                            // corresponding bit in DDI
                                            // register 44. Read returns 0.
#define DDI_SET4447_S0_S        0
//*****************************************************************************
//
// The following are defines for the bit fields in the DDI_O_SET4851 register.
//
//*****************************************************************************
#define DDI_SET4851_S3_M        0xFF000000  // A high bit value will set the
                                            // corresponding bit in DDI
                                            // register 51. Read returns 0.
#define DDI_SET4851_S3_S        24
#define DDI_SET4851_S2_M        0x00FF0000  // A high bit value will set the
                                            // corresponding bit in DDI
                                            // register 50. Read returns 0.
#define DDI_SET4851_S2_S        16
#define DDI_SET4851_S1_M        0x0000FF00  // A high bit value will set the
                                            // corresponding bit in DDI
                                            // register 49. Read returns 0.
#define DDI_SET4851_S1_S        8
#define DDI_SET4851_S0_M        0x000000FF  // A high bit value will set the
                                            // corresponding bit in DDI
                                            // register 48. Read returns 0.
#define DDI_SET4851_S0_S        0
//*****************************************************************************
//
// The following are defines for the bit fields in the DDI_O_SET5255 register.
//
//*****************************************************************************
#define DDI_SET5255_S3_M        0xFF000000  // A high bit value will set the
                                            // corresponding bit in DDI
                                            // register 55. Read returns 0.
#define DDI_SET5255_S3_S        24
#define DDI_SET5255_S2_M        0x00FF0000  // A high bit value will set the
                                            // corresponding bit in DDI
                                            // register 54. Read returns 0.
#define DDI_SET5255_S2_S        16
#define DDI_SET5255_S1_M        0x0000FF00  // A high bit value will set the
                                            // corresponding bit in DDI
                                            // register 53. Read returns 0.
#define DDI_SET5255_S1_S        8
#define DDI_SET5255_S0_M        0x000000FF  // A high bit value will set the
                                            // corresponding bit in DDI
                                            // register 52. Read returns 0.
#define DDI_SET5255_S0_S        0
//*****************************************************************************
//
// The following are defines for the bit fields in the DDI_O_SET5659 register.
//
//*****************************************************************************
#define DDI_SET5659_S3_M        0xFF000000  // A high bit value will set the
                                            // corresponding bit in DDI
                                            // register 59. Read returns 0.
#define DDI_SET5659_S3_S        24
#define DDI_SET5659_S2_M        0x00FF0000  // A high bit value will set the
                                            // corresponding bit in DDI
                                            // register 58. Read returns 0.
#define DDI_SET5659_S2_S        16
#define DDI_SET5659_S1_M        0x0000FF00  // A high bit value will set the
                                            // corresponding bit in DDI
                                            // register 57. Read returns 0.
#define DDI_SET5659_S1_S        8
#define DDI_SET5659_S0_M        0x000000FF  // A high bit value will set the
                                            // corresponding bit in DDI
                                            // register 56. Read returns 0.
#define DDI_SET5659_S0_S        0
//*****************************************************************************
//
// The following are defines for the bit fields in the DDI_O_SET6063 register.
//
//*****************************************************************************
#define DDI_SET6063_S3_M        0xFF000000  // A high bit value will set the
                                            // corresponding bit in DDI
                                            // register 63. Read returns 0.
#define DDI_SET6063_S3_S        24
#define DDI_SET6063_S2_M        0x00FF0000  // A high bit value will set the
                                            // corresponding bit in DDI
                                            // register 62. Read returns 0.
#define DDI_SET6063_S2_S        16
#define DDI_SET6063_S1_M        0x0000FF00  // A high bit value will set the
                                            // corresponding bit in DDI
                                            // register 61. Read returns 0.
#define DDI_SET6063_S1_S        8
#define DDI_SET6063_S0_M        0x000000FF  // A high bit value will set the
                                            // corresponding bit in DDI
                                            // register 60. Read returns 0.
#define DDI_SET6063_S0_S        0
//*****************************************************************************
//
// The following are defines for the bit fields in the DDI_O_CLR03 register.
//
//*****************************************************************************
#define DDI_CLR03_S3_M          0xFF000000  // A high bit value will clear the
                                            // corresponding bit in DDI
                                            // register 3
#define DDI_CLR03_S3_S          24
#define DDI_CLR03_S2_M          0x00FF0000  // A high bit value will clear the
                                            // corresponding bit in DDI
                                            // register 2
#define DDI_CLR03_S2_S          16
#define DDI_CLR03_S1_M          0x0000FF00  // A high bit value will clear the
                                            // corresponding bit in DDI
                                            // register 1
#define DDI_CLR03_S1_S          8
#define DDI_CLR03_S0_M          0x000000FF  // A high bit value will clear the
                                            // corresponding bit in DDI
                                            // register 0
#define DDI_CLR03_S0_S          0
//*****************************************************************************
//
// The following are defines for the bit fields in the DDI_O_CLR47 register.
//
//*****************************************************************************
#define DDI_CLR47_S3_M          0xFF000000  // A high bit value will clear the
                                            // corresponding bit in DDI
                                            // register 7
#define DDI_CLR47_S3_S          24
#define DDI_CLR47_S2_M          0x00FF0000  // A high bit value will clear the
                                            // corresponding bit in DDI
                                            // register 6
#define DDI_CLR47_S2_S          16
#define DDI_CLR47_S1_M          0x0000FF00  // A high bit value will clear the
                                            // corresponding bit in DDI
                                            // register 5
#define DDI_CLR47_S1_S          8
#define DDI_CLR47_S0_M          0x000000FF  // A high bit value will clear the
                                            // corresponding bit in DDI
                                            // register 4
#define DDI_CLR47_S0_S          0
//*****************************************************************************
//
// The following are defines for the bit fields in the DDI_O_CLR811 register.
//
//*****************************************************************************
#define DDI_CLR811_S3_M         0xFF000000  // A high bit value will clear the
                                            // corresponding bit in DDI
                                            // register 11
#define DDI_CLR811_S3_S         24
#define DDI_CLR811_S2_M         0x00FF0000  // A high bit value will clear the
                                            // corresponding bit in DDI
                                            // register 10
#define DDI_CLR811_S2_S         16
#define DDI_CLR811_S1_M         0x0000FF00  // A high bit value will clear the
                                            // corresponding bit in DDI
                                            // register 9
#define DDI_CLR811_S1_S         8
#define DDI_CLR811_S0_M         0x000000FF  // A high bit value will clear the
                                            // corresponding bit in DDI
                                            // register 8
#define DDI_CLR811_S0_S         0
//*****************************************************************************
//
// The following are defines for the bit fields in the DDI_O_CLR1215 register.
//
//*****************************************************************************
#define DDI_CLR1215_S3_M        0xFF000000  // A high bit value will clear the
                                            // corresponding bit in DDI
                                            // register 15
#define DDI_CLR1215_S3_S        24
#define DDI_CLR1215_S2_M        0x00FF0000  // A high bit value will clear the
                                            // corresponding bit in DDI
                                            // register 14
#define DDI_CLR1215_S2_S        16
#define DDI_CLR1215_S1_M        0x0000FF00  // A high bit value will clear the
                                            // corresponding bit in DDI
                                            // register 13
#define DDI_CLR1215_S1_S        8
#define DDI_CLR1215_S0_M        0x000000FF  // A high bit value will clear the
                                            // corresponding bit in DDI
                                            // register 12
#define DDI_CLR1215_S0_S        0
//*****************************************************************************
//
// The following are defines for the bit fields in the DDI_O_CLR1619 register.
//
//*****************************************************************************
#define DDI_CLR1619_S3_M        0xFF000000  // A high bit value will clear the
                                            // corresponding bit in DDI
                                            // register 19
#define DDI_CLR1619_S3_S        24
#define DDI_CLR1619_S2_M        0x00FF0000  // A high bit value will clear the
                                            // corresponding bit in DDI
                                            // register 18
#define DDI_CLR1619_S2_S        16
#define DDI_CLR1619_S1_M        0x0000FF00  // A high bit value will clear the
                                            // corresponding bit in DDI
                                            // register 17
#define DDI_CLR1619_S1_S        8
#define DDI_CLR1619_S0_M        0x000000FF  // A high bit value will clear the
                                            // corresponding bit in DDI
                                            // register 16
#define DDI_CLR1619_S0_S        0
//*****************************************************************************
//
// The following are defines for the bit fields in the DDI_O_CLR2023 register.
//
//*****************************************************************************
#define DDI_CLR2023_S3_M        0xFF000000  // A high bit value will clear the
                                            // corresponding bit in DDI
                                            // register 23
#define DDI_CLR2023_S3_S        24
#define DDI_CLR2023_S2_M        0x00FF0000  // A high bit value will clear the
                                            // corresponding bit in DDI
                                            // register 22
#define DDI_CLR2023_S2_S        16
#define DDI_CLR2023_S1_M        0x0000FF00  // A high bit value will clear the
                                            // corresponding bit in DDI
                                            // register 21
#define DDI_CLR2023_S1_S        8
#define DDI_CLR2023_S0_M        0x000000FF  // A high bit value will clear the
                                            // corresponding bit in DDI
                                            // register 20
#define DDI_CLR2023_S0_S        0
//*****************************************************************************
//
// The following are defines for the bit fields in the DDI_O_CLR2427 register.
//
//*****************************************************************************
#define DDI_CLR2427_S3_M        0xFF000000  // A high bit value will clear the
                                            // corresponding bit in DDI
                                            // register 27
#define DDI_CLR2427_S3_S        24
#define DDI_CLR2427_S2_M        0x00FF0000  // A high bit value will clear the
                                            // corresponding bit in DDI
                                            // register 26
#define DDI_CLR2427_S2_S        16
#define DDI_CLR2427_S1_M        0x0000FF00  // A high bit value will clear the
                                            // corresponding bit in DDI
                                            // register 25
#define DDI_CLR2427_S1_S        8
#define DDI_CLR2427_S0_M        0x000000FF  // A high bit value will clear the
                                            // corresponding bit in DDI
                                            // register 24
#define DDI_CLR2427_S0_S        0
//*****************************************************************************
//
// The following are defines for the bit fields in the DDI_O_CLR2831 register.
//
//*****************************************************************************
#define DDI_CLR2831_S3_M        0xFF000000  // A high bit value will clear the
                                            // corresponding bit in DDI
                                            // register 31
#define DDI_CLR2831_S3_S        24
#define DDI_CLR2831_S2_M        0x00FF0000  // A high bit value will clear the
                                            // corresponding bit in DDI
                                            // register 30
#define DDI_CLR2831_S2_S        16
#define DDI_CLR2831_S1_M        0x0000FF00  // A high bit value will clear the
                                            // corresponding bit in DDI
                                            // register 29
#define DDI_CLR2831_S1_S        8
