arduino/Arduino/hardware/cc2600emt/cores/cc2600emt/inc/hw_ddi.h
// DDI_O_MASK16B1617 register.
//
//*****************************************************************************
#define DDI_MASK16B1617_M_M     0xFFFF0000  // Mask for DDI register 16 and 17
#define DDI_MASK16B1617_M_S     16
#define DDI_MASK16B1617_D_M     0x0000FFFF  // Data for DDI register at
                                            // offsets 16 and 17, - only bits
                                            // selected by mask M will be
                                            // affected by access
#define DDI_MASK16B1617_D_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK16B1819 register.
//
//*****************************************************************************
#define DDI_MASK16B1819_M_M     0xFFFF0000  // Mask for DDI register 18 and 19
#define DDI_MASK16B1819_M_S     16
#define DDI_MASK16B1819_D_M     0x0000FFFF  // Data for DDI register at
                                            // offsets 18 and 19, - only bits
                                            // selected by mask M will be
                                            // affected by access
#define DDI_MASK16B1819_D_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK16B2021 register.
//
//*****************************************************************************
#define DDI_MASK16B2021_M_M     0xFFFF0000  // Mask for DDI register 20 and 21
#define DDI_MASK16B2021_M_S     16
#define DDI_MASK16B2021_D_M     0x0000FFFF  // Data for DDI register at
                                            // offsets 20 and 21, - only bits
                                            // selected by mask M will be
                                            // affected by access
#define DDI_MASK16B2021_D_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK16B2223 register.
//
//*****************************************************************************
#define DDI_MASK16B2223_M_M     0xFFFF0000  // Mask for DDI register 22 and 23
#define DDI_MASK16B2223_M_S     16
#define DDI_MASK16B2223_D_M     0x0000FFFF  // Data for DDI register at
                                            // offsets 22 and 23, - only bits
                                            // selected by mask M will be
                                            // affected by access
#define DDI_MASK16B2223_D_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK16B2425 register.
//
//*****************************************************************************
#define DDI_MASK16B2425_M_M     0xFFFF0000  // Mask for DDI register 24 and 25
#define DDI_MASK16B2425_M_S     16
#define DDI_MASK16B2425_D_M     0x0000FFFF  // Data for DDI register at
                                            // offsets 24 and 25, - only bits
                                            // selected by mask M will be
                                            // affected by access
#define DDI_MASK16B2425_D_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK16B2627 register.
//
//*****************************************************************************
#define DDI_MASK16B2627_M_M     0xFFFF0000  // Mask for DDI register 26 and 27
#define DDI_MASK16B2627_M_S     16
#define DDI_MASK16B2627_D_M     0x0000FFFF  // Data for DDI register at
                                            // offsets 26 and 27, - only bits
                                            // selected by mask M will be
                                            // affected by access
#define DDI_MASK16B2627_D_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK16B2829 register.
//
//*****************************************************************************
#define DDI_MASK16B2829_M_M     0xFFFF0000  // Mask for DDI register 28 and 29
#define DDI_MASK16B2829_M_S     16
#define DDI_MASK16B2829_D_M     0x0000FFFF  // Data for DDI register at
                                            // offsets 28 and 29, - only bits
                                            // selected by mask M will be
                                            // affected by access
#define DDI_MASK16B2829_D_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK16B3031 register.
//
//*****************************************************************************
#define DDI_MASK16B3031_M_M     0xFFFF0000  // Mask for DDI register 30 and 31
#define DDI_MASK16B3031_M_S     16
#define DDI_MASK16B3031_D_M     0x0000FFFF  // Data for DDI register at
                                            // offsets 30 and 31, - only bits
                                            // selected by mask M will be
                                            // affected by access
#define DDI_MASK16B3031_D_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK16B3233 register.
//
//*****************************************************************************
#define DDI_MASK16B3233_M_M     0xFFFF0000  // Mask for DDI register 32 and 33
#define DDI_MASK16B3233_M_S     16
#define DDI_MASK16B3233_D_M     0x0000FFFF  // Data for DDI register at
                                            // offsets 32 and 33, - only bits
                                            // selected by mask M will be
                                            // affected by access
#define DDI_MASK16B3233_D_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK16B3435 register.
//
//*****************************************************************************
#define DDI_MASK16B3435_M_M     0xFFFF0000  // Mask for DDI register 34 and 35
#define DDI_MASK16B3435_M_S     16
#define DDI_MASK16B3435_D_M     0x0000FFFF  // Data for DDI register at
                                            // offsets 34 and 35, - only bits
                                            // selected by mask M will be
                                            // affected by access
#define DDI_MASK16B3435_D_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK16B3637 register.
//
//*****************************************************************************
#define DDI_MASK16B3637_M_M     0xFFFF0000  // Mask for DDI register 36 and 37
#define DDI_MASK16B3637_M_S     16
#define DDI_MASK16B3637_D_M     0x0000FFFF  // Data for DDI register at
                                            // offsets 36 and 37, - only bits
                                            // selected by mask M will be
                                            // affected by access
#define DDI_MASK16B3637_D_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK16B3839 register.
//
//*****************************************************************************
#define DDI_MASK16B3839_M_M     0xFFFF0000  // Mask for DDI register 38 and 39
#define DDI_MASK16B3839_M_S     16
#define DDI_MASK16B3839_D_M     0x0000FFFF  // Data for DDI register at
                                            // offsets 38 and 39, - only bits
                                            // selected by mask M will be
                                            // affected by access
#define DDI_MASK16B3839_D_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK16B4041 register.
//
//*****************************************************************************
#define DDI_MASK16B4041_M_M     0xFFFF0000  // Mask for DDI register 40 and 41
#define DDI_MASK16B4041_M_S     16
#define DDI_MASK16B4041_D_M     0x0000FFFF  // Data for DDI register at
                                            // offsets 40 and 41, - only bits
                                            // selected by mask M will be
                                            // affected by access
#define DDI_MASK16B4041_D_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK16B4243 register.
//
//*****************************************************************************
#define DDI_MASK16B4243_M_M     0xFFFF0000  // Mask for DDI register 42 and 43
#define DDI_MASK16B4243_M_S     16
#define DDI_MASK16B4243_D_M     0x0000FFFF  // Data for DDI register at
                                            // offsets 42 and 43, - only bits
                                            // selected by mask M will be
                                            // affected by access
#define DDI_MASK16B4243_D_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK16B4445 register.
//
//*****************************************************************************
#define DDI_MASK16B4445_M_M     0xFFFF0000  // Mask for DDI register 44 and 45
#define DDI_MASK16B4445_M_S     16
#define DDI_MASK16B4445_D_M     0x0000FFFF  // Data for DDI register at
                                            // offsets 44 and 45, - only bits
                                            // selected by mask M will be
                                            // affected by access
#define DDI_MASK16B4445_D_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK16B4647 register.
//
//*****************************************************************************
#define DDI_MASK16B4647_M_M     0xFFFF0000  // Mask for DDI register 46 and 47
#define DDI_MASK16B4647_M_S     16
#define DDI_MASK16B4647_D_M     0x0000FFFF  // Data for DDI register at
                                            // offsets 46 and 47, - only bits
                                            // selected by mask M will be
                                            // affected by access
#define DDI_MASK16B4647_D_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK16B4849 register.
//
//*****************************************************************************
#define DDI_MASK16B4849_M_M     0xFFFF0000  // Mask for DDI register 48 and 49
#define DDI_MASK16B4849_M_S     16
#define DDI_MASK16B4849_D_M     0x0000FFFF  // Data for DDI register at
                                            // offsets 48 and 49, - only bits
                                            // selected by mask M will be
                                            // affected by access
#define DDI_MASK16B4849_D_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK16B5051 register.
//
//*****************************************************************************
#define DDI_MASK16B5051_M_M     0xFFFF0000  // Mask for DDI register 50 and 51
#define DDI_MASK16B5051_M_S     16
#define DDI_MASK16B5051_D_M     0x0000FFFF  // Data for DDI register at
                                            // offsets 50 and 51, - only bits
                                            // selected by mask M will be
                                            // affected by access
#define DDI_MASK16B5051_D_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK16B5253 register.
//
//*****************************************************************************
#define DDI_MASK16B5253_M_M     0xFFFF0000  // Mask for DDI register 52 and 53
#define DDI_MASK16B5253_M_S     16
#define DDI_MASK16B5253_D_M     0x0000FFFF  // Data for DDI register at
                                            // offsets 52 and 53, - only bits
                                            // selected by mask M will be
                                            // affected by access
#define DDI_MASK16B5253_D_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK16B5455 register.
//
//*****************************************************************************
#define DDI_MASK16B5455_M_M     0xFFFF0000  // Mask for DDI register 54 and 55
#define DDI_MASK16B5455_M_S     16
#define DDI_MASK16B5455_D_M     0x0000FFFF  // Data for DDI register at
                                            // offsets 54 and 55, - only bits
                                            // selected by mask M will be
                                            // affected by access
#define DDI_MASK16B5455_D_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK16B5657 register.
//
//*****************************************************************************
#define DDI_MASK16B5657_M_M     0xFFFF0000  // Mask for DDI register 56 and 57
#define DDI_MASK16B5657_M_S     16
#define DDI_MASK16B5657_D_M     0x0000FFFF  // Data for DDI register at
                                            // offsets 56 and 57, - only bits
                                            // selected by mask M will be
                                            // affected by access
#define DDI_MASK16B5657_D_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK16B5859 register.
//
//*****************************************************************************
#define DDI_MASK16B5859_M_M     0xFFFF0000  // Mask for DDI register 58 and 59
#define DDI_MASK16B5859_M_S     16
#define DDI_MASK16B5859_D_M     0x0000FFFF  // Data for DDI register at
                                            // offsets 58 and 59, - only bits
                                            // selected by mask M will be
                                            // affected by access
#define DDI_MASK16B5859_D_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK16B6061 register.
//
//*****************************************************************************
#define DDI_MASK16B6061_M_M     0xFFFF0000  // Mask for DDI register 60 and 61
#define DDI_MASK16B6061_M_S     16
#define DDI_MASK16B6061_D_M     0x0000FFFF  // Data for DDI register at
                                            // offsets 60 and 61, - only bits
                                            // selected by mask M will be
                                            // affected by access
#define DDI_MASK16B6061_D_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// DDI_O_MASK16B6263 register.
//
//*****************************************************************************
#define DDI_MASK16B6263_M_M     0xFFFF0000  // Mask for DDI register 62 and 63
#define DDI_MASK16B6263_M_S     16
#define DDI_MASK16B6263_D_M     0x0000FFFF  // Data for DDI register at
                                            // offsets 62 and 63, - only bits
                                            // selected by mask M will be
                                            // affected by access
#define DDI_MASK16B6263_D_S     0

#endif // __HW_DDI_H__
